Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  shutoffLeds();
  alertLedActive = false;

  if (autoDimEnabled) {
    uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
    setOledBrightness(dimLevel);
  } else {
    setOledBrightness(userBrightness);
  }

  if (isNightWindow()) {
    currentEmotion = EMO_SLEEP;
  } else if (isMorningWindow()) {
    setEmotion(EMO_LOVE);
  } else {
    currentEmotion = EMO_NORMAL;
  }

  display.clearDisplay();
  display.display();
}

void unlockDevice() {
  isDeviceLocked = false;
  isPeekClockActive = false;
  isSmsAlertActive = false;
  lastUserActivity = millis();

  setOledBrightness(userBrightness);

  display.clearDisplay();
  configureMode(resumeMode);
}

// Draw a smooth Desk-Buddy style eye with rounded square outline and inner pupil
void drawDeskBuddyEye(int x, int y, int w, int h, int pupilShiftX, int pupilShiftY) {
  if (h <= 4) {
    display.fillRoundRect(x, y + 13, w, 4, 2, SSD1306_WHITE);
    return;
  }

  int cornerRadius = 9;
  if (h < 18) cornerRadius = h / 2;

  display.fillRoundRect(x, y, w, h, cornerRadius, SSD1306_WHITE);

  int pupilW = 10;
  int pupilH = (h > 16) ? 10 : (h - 6);
  if (pupilH < 3) pupilH = 3;

  int pupilCenterX = x + (w / 2) + pupilShiftX;
  int pupilCenterY = y + (h / 2) + pupilShiftY;

  display.fillRoundRect(pupilCenterX - (pupilW / 2), pupilCenterY - (pupilH / 2), pupilW, pupilH, 3, SSD1306_BLACK);
}

// Draw happy curved arched eye (Desk-Buddy inverted crescent)
void drawHappyArchedEye(int x, int y, int w) {
  display.fillRoundRect(x, y, w, 18, 9, SSD1306_WHITE);
  display.fillRoundRect(x, y + 6, w, 18, 9, SSD1306_BLACK);
}

// Draw small heart icon between eyes
void drawSmallHeart(int x, int y) {
  display.fillCircle(x - 2, y, 2, SSD1306_WHITE);
  display.fillCircle(x + 2, y, 2, SSD1306_WHITE);
  display.fillTriangle(x - 4, y, x + 4, y, x, y + 5, SSD1306_WHITE);
}

// Quick banner overlay showing Auto-Lock status
void drawAutoLockBanner() {
  display.clearDisplay();
  display.drawRoundRect(10, 14, 108, 36, 6, SSD1306_WHITE);
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(24, 20);
  display.print("AUTO-LOCK:");
  display.setTextSize(2);
  display.setCursor(44, 32);
  display.print(autoLockEnabled ? "ON" : "OFF");
  display.display();
}

// On-screen SMS / Reminder Display
void drawSmsAlertUI() {
  display.clearDisplay();
  display.drawRoundRect(2, 2, 124, 60, 6, SSD1306_WHITE);
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  display.setCursor(16, 8);
  display.print("*** SMS ALERT ***");
  display.drawLine(6, 18, 121, 18, SSD1306_WHITE);

  display.setCursor(8, 24);
  display.print(scheduledSmsText);

  display.setCursor(18, 50);
  display.print("[Press D5 to exit]");
  display.display();
}

// Periodic check against real NTP time for scheduled SMS trigger
void checkScheduledSms() {
  if (scheduledSmsEpoch == 0 || isSmsAlertActive) return;

  time_t now = time(nullptr);
  if (now < 100000) return; // NTP not yet synced

  // Trigger when current time is within or slightly past the target minute
  if ((uint32_t)now >= scheduledSmsEpoch && (uint32_t)now < scheduledSmsEpoch + 120) {
    isSmsAlertActive = true;
    smsAlertStartTime = millis();
    triggerLedAlert();
    setEmotion(EMO_LOVE);
    clearScheduledSms(); // Clear schedule after triggering
  }
}

// Desk-Buddy Emotional Engine Renderer
void drawEmoFace() {
  unsigned long now = millis();

  if (currentEmotion != EMO_NORMAL && currentEmotion != EMO_SLEEP) {
    if (now - emotionHoldStartTime > EMOTION_HOLD_MS) {
      currentEmotion = isNightWindow() ? EMO_SLEEP : EMO_NORMAL;
    }
  } else {
    if (isNightWindow()) {
      currentEmotion = EMO_SLEEP;
    }
  }

  display.clearDisplay();

  const int eyeW = 30;
  const int leftEyeBaseX = 24;
  const int rightEyeBaseX = 74;
  const int eyeBaseY = 17;

  // 1. LOVING / HAPPY STATE (Arched eyes with heart)[cite: 6]
  if (currentEmotion == EMO_LOVE) {
    drawHappyArchedEye(leftEyeBaseX, eyeBaseY + 4, eyeW);
    drawHappyArchedEye(rightEyeBaseX, eyeBaseY + 4, eyeW);
    drawSmallHeart(64, eyeBaseY + 2);
    display.display();
    return;
  }

  // 2. SLEEPING STATE (Bottom-curved sleepy half circles with floating Zzz)
  if (currentEmotion == EMO_SLEEP) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);

    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 14, 7, SSD1306_WHITE);
    display.fillRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 7, SSD1306_BLACK);

    if (now - lastZzzAnim > 350) {
      lastZzzAnim = now;
      zzzStep = (zzzStep + 1) % 4;
    }
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    if (zzzStep >= 1) { display.setCursor(98, 22); display.print("z"); }
    if (zzzStep >= 2) { display.setCursor(106, 14); display.print("Z"); }
    if (zzzStep >= 3) { display.setCursor(114, 6);  display.print("Z"); }

    display.display();
    return;
  }

  // 3. SHOCKED STATE (Expanded wide circles with small center pupils)
  if (currentEmotion == EMO_SHOCKED) {
    int lx = leftEyeBaseX + 15;
    int rx = rightEyeBaseX + 15;
    int cy = eyeBaseY + 15;

    display.fillCircle(lx, cy, 18, SSD1306_WHITE);
    display.fillCircle(rx, cy, 18, SSD1306_WHITE);
    display.fillCircle(lx, cy, 6, SSD1306_BLACK);
    display.fillCircle(rx, cy, 6, SSD1306_BLACK);

    display.display();
    return;
  }

  // 4. SUSPICIOUS / SQUINT STATE
  if (currentEmotion == EMO_SUSPICIOUS) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 8, eyeW, 16, 4, SSD1306_WHITE);

    display.fillTriangle(leftEyeBaseX, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 8, leftEyeBaseX + eyeW, eyeBaseY + 14, SSD1306_BLACK);
    display.fillTriangle(rightEyeBaseX, eyeBaseY + 8, rightEyeBaseX + eyeW, eyeBaseY + 8, rightEyeBaseX, eyeBaseY + 14, SSD1306_BLACK);

    display.fillRect(leftEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);
    display.fillRect(rightEyeBaseX + 10, eyeBaseY + 12, 10, 8, SSD1306_BLACK);

